# Создайте собственный класс-исключение, который должен проверять содержимое списка на наличие только чисел.
# Проверить работу исключения на реальном примере. Необходимо запрашивать у пользователя данные и заполнять список.
# Класс-исключение должен контролировать типы данных элементов списка.
# Примечание: длина списка не фиксирована. Элементы запрашиваются бесконечно, пока пользователь сам не остановит работу
# скрипта, введя, например, команду “stop”. При этом скрипт завершается, сформированный список выводится на экран.
# Подсказка: для данного задания примем, что пользователь может вводить только числа и строки. При вводе пользователем
# очередного элемента необходимо реализовать проверку типа элемента и вносить его в список, только если введено число.
# Класс-исключение должен не позволить пользователю ввести текст (не число) и отобразить соответствующее сообщение.
# При этом работа скрипта не должна завершаться.

class ContainsNumOnly(Exception):
    def __init__(self, txt):
        self.txt = txt


res_list = []
while True:
    user_string = input('Для остановки введите stop\nВведите числа: ')
    if user_string == 'stop':
        print(f"{res_list}")
        break
    else:
        try:
            user_string.isdigit()
            if user_string.isdigit() is not True:
                raise ContainsNumOnly("Можно вводить только числа")
        except ContainsNumOnly as err:
            print(err)
        else:
            res_list.append(user_string)
            print(f"{res_list}")
